Enums/ВариантыЗагрузкиКартинокДокументовЭлектронныхКурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВариантыЗагрузкиКартинокДокументовЭлектронныхКурсов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Стандартные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исходные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УвеличиватьСтандартные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УвеличиватьИсходные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасширятьСтандартные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасширятьИсходные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВариантыЗагрузкиКартинокДокументовЭлектронныхКурсов/Ext/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Свойство("УпрощенныйРежим") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ДанныеВыбора = Новый СписокЗначений;

		Элемент = ДанныеВыбора.Добавить();
		Элемент.Значение = Перечисления.ВариантыЗагрузкиКартинокДокументовЭлектронныхКурсов.Стандартные;
		Элемент.Представление = НСтр("ru = 'Стандартные'");
		
		Элемент = ДанныеВыбора.Добавить();
		Элемент.Значение = Перечисления.ВариантыЗагрузкиКартинокДокументовЭлектронныхКурсов.Исходные;
		Элемент.Представление = НСтр("ru = 'Исходные'");
		
		Элемент = ДанныеВыбора.Добавить();
		Элемент.Значение = Перечисления.ВариантыЗагрузкиКартинокДокументовЭлектронныхКурсов.УвеличиватьСтандартные;
		Элемент.Представление = НСтр("ru = 'Увеличивать стандартные'");
		
		Элемент = ДанныеВыбора.Добавить();
		Элемент.Значение = Перечисления.ВариантыЗагрузкиКартинокДокументовЭлектронныхКурсов.РасширятьСтандартные;
		Элемент.Представление = НСтр("ru = 'Расширять стандартные'");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
